{
  "utaku_description": {
    "message": "When you leave this popup open and open a new page or call refresh, the URL is collected."
  },
  "close": {
    "message": "Close"
  },
  "set_url_remap": {
    "message": "Remapped URL"
  },
  "input_remap_name": {
    "message": "Please input remap name."
  },
  "edit_url_match": {
    "message": "Edit Match URL"
  },
  "edit_sub_domain": {
    "message": "Edit Sub Domain"
  },
  "input_sub_domain": {
    "message": "Input the subdomain to change. If left blank, it will be removed."
  },
  "input_url_match": {
    "message": "Please enter a matching URL pattern."
  },
  "url_remap_list": {
    "message": "URL Remap List"
  },
  "remaps": {
    "message": "Remaps"
  },
  "remaps_only": {
    "message": "Remaps Only"
  },
  "edit_query": {
    "message": "Edit Query"
  },
  "change_add_text": {
    "message": "Change/Add Text"
  },
  "edit_remap_name": {
    "message": "Remap Name"
  },
  "already_exists_name": {
    "message": "already exists name."
  },
  "input_name": {
    "message": "Please input name."
  },
  "input_query_description": {
    "message": "You can change and delete by adding a query."
  },
  "apply": {
    "message": "Apply"
  },
  "add_query": {
    "message": "Add Query"
  },
  "add": {
    "message": "Add"
  },
  "name": {
    "message": "Name"
  },
  "save": {
    "message": "Save"
  },
  "edit": {
    "message": "Edit"
  },
  "prev": {
    "message": "Prev"
  },
  "next": {
    "message": "Next"
  },
  "input_content": {
    "message": "Please input content."
  },
  "input_query_content": {
    "message": "Input content or Remove with empty input."
  },
  "delete": {
    "message": "delete"
  },
  "empty_remap": {
    "message": "Empty Remap"
  },
  "list": {
    "message": "List"
  },
  "enter": {
    "message": "Enter"
  },
  "refresh": {
    "message": "Refresh"
  },
  "disposed_item": {
    "message": "Disposed Item"
  },
  "queue": {
    "message": "Queue"
  },
  "error": {
    "message": "Error"
  },
  "clear": {
    "message": "Clear"
  },
  "change": {
    "message": "Change"
  },
  "replace_url": {
    "message": "Replace URL"
  },
  "return_removed": {
    "message": "Return Removed"
  },
  "remove": {
    "message": "Remove"
  },
  "query_change": {
    "message": "Query Change"
  },
  "query_remove": {
    "message": "Query Remove"
  },
  "query_append": {
    "message": "Query Append"
  },
  "requeue": {
    "message": "Requeue"
  },
  "collect_description": {
    "message": "It collects the URL of the page you're viewing.\nPlease refresh or access a new page."
  },
  "url_reference": {
    "message": "Reference URL"
  },
  "reference_url_description": {
    "message": "Please enter the URL to be used as an example. You can check the result through a preview."
  },
  "applied_remaps": {
    "message": "Applying $count$ remaps",
    "placeholders": {
      "count": {
        "content": "$1",
        "example": "0"
      }
    }
  },
  "path_changer": {
    "message": "Edit Paths"
  },
  "path_index": {
    "message": "Path Index"
  },
  "no_valid_reference_url": {
    "message": "No valid reference URL"
  },
  "changed_result": {
    "message": "Changed Result"
  },
  "no_folder": {
    "message": "Not found folder name ist"
  },
  "basic_usage": {
    "message": "Basic Usage"
  },
  "basic_usage_description": {
    "message": "1. Click the UTAKU extension button to open the popup window.\n2. Visit the page you want to collect or refresh it.\n3. Images are collected dynamically. Explore the pages while keeping the popup window open, and images will be automatically collected for each tab.\n4. Click the activated utaku button at the bottom of the page, or click the confirm button in the popup window.\n5. Select the images and download them."
  },
  "simple_mode": {
    "message": "Simple Mode"
  },
  "simple_mode_description": {
    "message": "1. Click on the UTAKU extension button.\n2. If it's not bound, a refresh will occur. Then, please click the icon again.\n3. Images are collected statically. If you reload or press 'Reload' the images will be gathered again.\n4. Select the image and click on 'Download' to download the image.\n** Note: Simple Mode may not work on some sites, or some images may be missing."
  },
  "enhanced_mode": {
    "message": "Enhanced Mode"
  },
  "remap_usage": {
    "message": "Remap Usage"
  },
  "remap_usage_description": {
    "message": "Remap helps you download desired images by modifying the URL.*If you enter a reference URL, you can check the results of the changes.\n* Path changes can only be edited if there is a reference URL.\n* Please enter the editing URL pattern. URL reconstruction will only be applied to matching addresses.\n1. Click the third button below the collected image, or click the first icon in the list in the popup window.\n2. The default values are set according to the URL.\n3. Enter the changes you want and add them.\n4. Click the reconstruction button at the bottom left of the popup window.\n5. Check the items you want and click apply.\n6. The changes will be applied sequentially. query -> path -> replace\n7. Remap only works after being applied. If you want to apply it to existing images, please refresh.\n8. Methods for reconstruction are uploaded on YouTube. Please check the following."
  },
  "remap_by_query_edit": {
    "message": "Edit Query to Remap"
  },
  "remap_by_query_edit_description": {
    "message": "By using the reconstruction button, the queries included in the URL will be automatically registered. If you register a query key and leave its value empty, that query will be deleted."
  },
  "remap_by_path_edit": {
    "message": "Edit Path to Remap"
  },
  "remap_by_path_edit_description": {
    "message": "You can extract the path from the reference URL, excluding the query and host address, and choose it. You can change it to the text you want at that location. If there's no reference URL, registration/editing is not possible because the location value must be implemented."
  },
  "remap_by_replace_edit": {
    "message": "Edit URL Replace to Remap"
  },
  "remap_by_replace_edit_description": {
    "message": "You can change the desired part of the URL to different text. If you leave the 'from' value empty and write the 'to', it will be added at the end of the URL. This logic operates last."
  },
  "utaku_about": {
    "message": "UTAKU is an image/media downloader designed to save you time.\nIt can remap URLs to fetch original source URLs, which are all customizable to your settings.\n\n Upon activation of the pop-up, you may need to open or refresh your browser to enable UTAKU to read your network resource headers and collect resources.\nThe pop-up stays active, dynamically updating as new images are downloaded. To make sure all images are displayed correctly, UTAKU ingeniously verifies image sizes right in the browser tab where they appear, bypassing technical barriers in a lawful manner.\n\n Be cautious though, as using UTAKU may sometimes cause excessive traffic, potentially resulting in temporary loss of access to certain sites. Use it at your own risk and refrain from using images or videos with copyright issues.\nYou are free to use UTAKU, but we do not take any responsibility for using downloaded images or videos."
  },
  "reload": {
    "message": "Reload"
  },
  "no_images": {
    "message": "No images"
  },
  "re_loading": {
    "message": "Re Loading"
  },
  "reference_url_guidance": {
    "message": "(Required) Please enter a sample URL. (include http(s))\n\n ex) https://pbs.twimg.com/media/F5wQfOjWYAAQ5zi?format=webp&name=small"
  },
  "name_guidance": {
    "message": "(Required) Please enter a name. This name will be displayed on the URL reconstruction list."
  },
  "host_guidance": {
    "message": "(Required) URL reconstruction is applied only when this value matches the image URL being collected. The default value is the host (domain root address)."
  },
  "sub_domain_guidance": {
    "message": "(Optional) If you want to change the Sub Domain, please enter it. For example, in post.example.com, 'post' is the Sub Domain. Change it at the location corresponding to the Sub Domain, use the final 'Replace' if you want to change a specific address value."
  },
  "params_guidance": {
    "message": "(Optional) If you want to change the query of the URL, please enter it. For example, in post.example.com?q=1234, 'q=1234' is the query and 'q' is the key and '1234' is the value. Add the key you want to change and change it to the desired value. If you only add the key and leave the value empty, the query will be removed."
  },
  "path_change_guidance": {
    "message": "(Optional) If you want to change the pathname of the URL, please enter it. For example, in post.example.com/post/1234, 'post/1234' is the pathname. You can replace this with the pathname extracted from the reference URL. Click the corresponding location and change it to the desired value."
  },
  "replace_guidance": {
    "message": "(Optional) If you want to change a specific value in the URL to a desired value, please enter it. For example, if you want to change 'post' to 'post2' in post.example.com/post/1234, enter 'post' in 'from' and 'post2' in 'to'. This operation is applied after all previous operations are complete."
  },
  "view_result": {
    "message": "View Result"
  }
}
